DISTORTEC/distortos/source/chip/STM32/peripherals/USARTv1/include/distortos/chip/STM32-USARTv1-bits.h
/**
 * \file
 * \brief Header with definition of bits in STM32 USARTv1 control registers
 *
 * \author Copyright (C) 2016 Kamil Szczygiel http://www.distortec.com http://www.freddiechopin.info
 *
 * \par License
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not
 * distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/.
 */

#ifndef SOURCE_CHIP_STM32_PERIPHERALS_USARTV1_INCLUDE_DISTORTOS_CHIP_STM32_USARTV1_BITS_H_
#define SOURCE_CHIP_STM32_PERIPHERALS_USARTV1_INCLUDE_DISTORTOS_CHIP_STM32_USARTV1_BITS_H_

#include "distortos/architecture/ARMv7-M-bit-banding.h"

/*---------------------------------------------------------------------------------------------------------------------+
| USART_SR - Status register
+---------------------------------------------------------------------------------------------------------------------*/

#define USART_SR_CTS_bit					9
#define USART_SR_LBD_bit					8
#define USART_SR_TXE_bit					7
#define USART_SR_TC_bit						6
#define USART_SR_RXNE_bit					5
#define USART_SR_IDLE_bit					4
#define USART_SR_ORE_bit					3
#define USART_SR_NF_bit						2
#define USART_SR_FE_bit						1
#define USART_SR_PE_bit						0

#define USARTx_SR_CTS_bb(base)				BITBAND(&(base)->SR, USART_SR_CTS_bit)
#define USARTx_SR_LBD_bb(base)				BITBAND(&(base)->SR, USART_SR_LBD_bit)
#define USARTx_SR_TXE_bb(base)				BITBAND(&(base)->SR, USART_SR_TXE_bit)
#define USARTx_SR_TC_bb(base)				BITBAND(&(base)->SR, USART_SR_TC_bit)
#define USARTx_SR_RXNE_bb(base)				BITBAND(&(base)->SR, USART_SR_RXNE_bit)
#define USARTx_SR_IDLE_bb(base)				BITBAND(&(base)->SR, USART_SR_IDLE_bit)
#define USARTx_SR_ORE_bb(base)				BITBAND(&(base)->SR, USART_SR_ORE_bit)
#define USARTx_SR_NF_bb(base)				BITBAND(&(base)->SR, USART_SR_NF_bit)
#define USARTx_SR_FE_bb(base)				BITBAND(&(base)->SR, USART_SR_FE_bit)
#define USARTx_SR_PE_bb(base)				BITBAND(&(base)->SR, USART_SR_PE_bit)

#define USART1_SR_CTS_bb					USARTx_SR_CTS_bb(USART1)
#define USART1_SR_LBD_bb					USARTx_SR_LBD_bb(USART1)
#define USART1_SR_TXE_bb					USARTx_SR_TXE_bb(USART1)
#define USART1_SR_TC_bb						USARTx_SR_TC_bb(USART1)
#define USART1_SR_RXNE_bb					USARTx_SR_RXNE_bb(USART1)
#define USART1_SR_IDLE_bb					USARTx_SR_IDLE_bb(USART1)
#define USART1_SR_ORE_bb					USARTx_SR_ORE_bb(USART1)
#define USART1_SR_NF_bb						USARTx_SR_NF_bb(USART1)
#define USART1_SR_FE_bb						USARTx_SR_FE_bb(USART1)
#define USART1_SR_PE_bb						USARTx_SR_PE_bb(USART1)

#define USART2_SR_CTS_bb					USARTx_SR_CTS_bb(USART2)
#define USART2_SR_LBD_bb					USARTx_SR_LBD_bb(USART2)
#define USART2_SR_TXE_bb					USARTx_SR_TXE_bb(USART2)
#define USART2_SR_TC_bb						USARTx_SR_TC_bb(USART2)
#define USART2_SR_RXNE_bb					USARTx_SR_RXNE_bb(USART2)
#define USART2_SR_IDLE_bb					USARTx_SR_IDLE_bb(USART2)
#define USART2_SR_ORE_bb					USARTx_SR_ORE_bb(USART2)
#define USART2_SR_NF_bb						USARTx_SR_NF_bb(USART2)
#define USART2_SR_FE_bb						USARTx_SR_FE_bb(USART2)
#define USART2_SR_PE_bb						USARTx_SR_PE_bb(USART2)

#define USART3_SR_CTS_bb					USARTx_SR_CTS_bb(USART3)
#define USART3_SR_LBD_bb					USARTx_SR_LBD_bb(USART3)
#define USART3_SR_TXE_bb					USARTx_SR_TXE_bb(USART3)
#define USART3_SR_TC_bb						USARTx_SR_TC_bb(USART3)
#define USART3_SR_RXNE_bb					USARTx_SR_RXNE_bb(USART3)
#define USART3_SR_IDLE_bb					USARTx_SR_IDLE_bb(USART3)
#define USART3_SR_ORE_bb					USARTx_SR_ORE_bb(USART3)
#define USART3_SR_NF_bb						USARTx_SR_NF_bb(USART3)
#define USART3_SR_FE_bb						USARTx_SR_FE_bb(USART3)
#define USART3_SR_PE_bb						USARTx_SR_PE_bb(USART3)

#define UART4_SR_LBD_bb						USARTx_SR_LBD_bb(UART4)
#define UART4_SR_TXE_bb						USARTx_SR_TXE_bb(UART4)
#define UART4_SR_TC_bb						USARTx_SR_TC_bb(UART4)
#define UART4_SR_RXNE_bb					USARTx_SR_RXNE_bb(UART4)
#define UART4_SR_IDLE_bb					USARTx_SR_IDLE_bb(UART4)
#define UART4_SR_ORE_bb						USARTx_SR_ORE_bb(UART4)
#define UART4_SR_NF_bb						USARTx_SR_NF_bb(UART4)
#define UART4_SR_FE_bb						USARTx_SR_FE_bb(UART4)
#define UART4_SR_PE_bb						USARTx_SR_PE_bb(UART4)

#define UART5_SR_LBD_bb						USARTx_SR_LBD_bb(UART5)
#define UART5_SR_TXE_bb						USARTx_SR_TXE_bb(UART5)
#define UART5_SR_TC_bb						USARTx_SR_TC_bb(UART5)
#define UART5_SR_RXNE_bb					USARTx_SR_RXNE_bb(UART5)
#define UART5_SR_IDLE_bb					USARTx_SR_IDLE_bb(UART5)
#define UART5_SR_ORE_bb						USARTx_SR_ORE_bb(UART5)
#define UART5_SR_NF_bb						USARTx_SR_NF_bb(UART5)
#define UART5_SR_FE_bb						USARTx_SR_FE_bb(UART5)
#define UART5_SR_PE_bb						USARTx_SR_PE_bb(UART5)

#define USART6_SR_CTS_bb					USARTx_SR_CTS_bb(USART6)
#define USART6_SR_LBD_bb					USARTx_SR_LBD_bb(USART6)
#define USART6_SR_TXE_bb					USARTx_SR_TXE_bb(USART6)
#define USART6_SR_TC_bb						USARTx_SR_TC_bb(USART6)
#define USART6_SR_RXNE_bb					USARTx_SR_RXNE_bb(USART6)
#define USART6_SR_IDLE_bb					USARTx_SR_IDLE_bb(USART6)
#define USART6_SR_ORE_bb					USARTx_SR_ORE_bb(USART6)
#define USART6_SR_NF_bb						USARTx_SR_NF_bb(USART6)
#define USART6_SR_FE_bb						USARTx_SR_FE_bb(USART6)
#define USART6_SR_PE_bb						USARTx_SR_PE_bb(USART6)

#define UART7_SR_LBD_bb						USARTx_SR_LBD_bb(UART7)
#define UART7_SR_TXE_bb						USARTx_SR_TXE_bb(UART7)
#define UART7_SR_TC_bb						USARTx_SR_TC_bb(UART7)
#define UART7_SR_RXNE_bb					USARTx_SR_RXNE_bb(UART7)
#define UART7_SR_IDLE_bb					USARTx_SR_IDLE_bb(UART7)
#define UART7_SR_ORE_bb						USARTx_SR_ORE_bb(UART7)
#define UART7_SR_NF_bb						USARTx_SR_NF_bb(UART7)
#define UART7_SR_FE_bb						USARTx_SR_FE_bb(UART7)
#define UART7_SR_PE_bb						USARTx_SR_PE_bb(UART7)

#define UART8_SR_LBD_bb						USARTx_SR_LBD_bb(UART8)
#define UART8_SR_TXE_bb						USARTx_SR_TXE_bb(UART8)
#define UART8_SR_TC_bb						USARTx_SR_TC_bb(UART8)
#define UART8_SR_RXNE_bb					USARTx_SR_RXNE_bb(UART8)
#define UART8_SR_IDLE_bb					USARTx_SR_IDLE_bb(UART8)
#define UART8_SR_ORE_bb						USARTx_SR_ORE_bb(UART8)
#define UART8_SR_NF_bb						USARTx_SR_NF_bb(UART8)
#define UART8_SR_FE_bb						USARTx_SR_FE_bb(UART8)
#define UART8_SR_PE_bb						USARTx_SR_PE_bb(UART8)

