DISTORTEC/distortos/source/chip/STM32/peripherals/USARTv1/include/distortos/chip/STM32-USARTv1-bits.h
#define USART6_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(USART6)
#define USART6_CR1_UE_bb					USARTx_CR1_UE_bb(USART6)
#define USART6_CR1_M_bb						USARTx_CR1_M_bb(USART6)
#define USART6_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(USART6)
#define USART6_CR1_PCE_bb					USARTx_CR1_PCE_bb(USART6)
#define USART6_CR1_PS_bb					USARTx_CR1_PS_bb(USART6)
#define USART6_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(USART6)
#define USART6_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(USART6)
#define USART6_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(USART6)
#define USART6_CR1_RXNEIE_bb				USARTx_CR1_RXNEIE_bb(USART6)
#define USART6_CR1_IDLEIE_bb				USARTx_CR1_IDLEIE_bb(USART6)
#define USART6_CR1_TE_bb					USARTx_CR1_TE_bb(USART6)
#define USART6_CR1_RE_bb					USARTx_CR1_RE_bb(USART6)
#define USART6_CR1_RWU_bb					USARTx_CR1_RWU_bb(USART6)
#define USART6_CR1_SBK_bb					USARTx_CR1_SBK_bb(USART6)

#define UART7_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(UART7)
#define UART7_CR1_UE_bb						USARTx_CR1_UE_bb(UART7)
#define UART7_CR1_M_bb						USARTx_CR1_M_bb(UART7)
#define UART7_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(UART7)
#define UART7_CR1_PCE_bb					USARTx_CR1_PCE_bb(UART7)
#define UART7_CR1_PS_bb						USARTx_CR1_PS_bb(UART7)
#define UART7_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(UART7)
#define UART7_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(UART7)
#define UART7_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(UART7)
#define UART7_CR1_RXNEIE_bb					USARTx_CR1_RXNEIE_bb(UART7)
#define UART7_CR1_IDLEIE_bb					USARTx_CR1_IDLEIE_bb(UART7)
#define UART7_CR1_TE_bb						USARTx_CR1_TE_bb(UART7)
#define UART7_CR1_RE_bb						USARTx_CR1_RE_bb(UART7)
#define UART7_CR1_RWU_bb					USARTx_CR1_RWU_bb(UART7)
#define UART7_CR1_SBK_bb					USARTx_CR1_SBK_bb(UART7)

#define UART8_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(UART8)
#define UART8_CR1_UE_bb						USARTx_CR1_UE_bb(UART8)
#define UART8_CR1_M_bb						USARTx_CR1_M_bb(UART8)
#define UART8_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(UART8)
#define UART8_CR1_PCE_bb					USARTx_CR1_PCE_bb(UART8)
#define UART8_CR1_PS_bb						USARTx_CR1_PS_bb(UART8)
#define UART8_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(UART8)
#define UART8_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(UART8)
#define UART8_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(UART8)
#define UART8_CR1_RXNEIE_bb					USARTx_CR1_RXNEIE_bb(UART8)
#define UART8_CR1_IDLEIE_bb					USARTx_CR1_IDLEIE_bb(UART8)
#define UART8_CR1_TE_bb						USARTx_CR1_TE_bb(UART8)
#define UART8_CR1_RE_bb						USARTx_CR1_RE_bb(UART8)
#define UART8_CR1_RWU_bb					USARTx_CR1_RWU_bb(UART8)
#define UART8_CR1_SBK_bb					USARTx_CR1_SBK_bb(UART8)

/*---------------------------------------------------------------------------------------------------------------------+
| USART_CR2 - Control register 2
+---------------------------------------------------------------------------------------------------------------------*/

#define USART_CR2_LINEN_bit					14
#define USART_CR2_STOP_bit					12
#define USART_CR2_STOP_0_bit				12
#define USART_CR2_STOP_1_bit				13
#define USART_CR2_CLKEN_bit					11
#define USART_CR2_CPOL_bit					10
#define USART_CR2_CPHA_bit					9
#define USART_CR2_LBCL_bit					8
#define USART_CR2_LBDIE_bit					6
#define USART_CR2_LBDL_bit					5
#define USART_CR2_ADD_bit					0
#define USART_CR2_ADD_0_bit					0
#define USART_CR2_ADD_1_bit					1
#define USART_CR2_ADD_2_bit					2
#define USART_CR2_ADD_3_bit					3

#define USART_CR2_STOP_1BIT_value			0
#define USART_CR2_STOP_05BIT_value			1
#define USART_CR2_STOP_2BIT_value			2
#define USART_CR2_STOP_15BIT_value			3
#define USART_CR2_STOP_mask					3

#define USART_CR2_STOP_1BIT					(USART_CR2_STOP_1BIT_value << USART_CR2_STOP_bit)
#define USART_CR2_STOP_05BIT				(USART_CR2_STOP_05BIT_value << USART_CR2_STOP_bit)
#define USART_CR2_STOP_2BIT					(USART_CR2_STOP_2BIT_value << USART_CR2_STOP_bit)
#define USART_CR2_STOP_15BIT				(USART_CR2_STOP_15BIT_value << USART_CR2_STOP_bit)

#define USARTx_CR2_LINEN_bb(base)			BITBAND(&(base)->CR2, USART_CR2_LINEN_bit)
#define USARTx_CR2_STOP_0_bb(base)			BITBAND(&(base)->CR2, USART_CR2_STOP_0_bit)
#define USARTx_CR2_STOP_1_bb(base)			BITBAND(&(base)->CR2, USART_CR2_STOP_1_bit)
#define USARTx_CR2_CLKEN_bb(base)			BITBAND(&(base)->CR2, USART_CR2_CLKEN_bit)
#define USARTx_CR2_CPOL_bb(base)			BITBAND(&(base)->CR2, USART_CR2_CPOL_bit)
#define USARTx_CR2_CPHA_bb(base)			BITBAND(&(base)->CR2, USART_CR2_CPHA_bit)
#define USARTx_CR2_LBCL_bb(base)			BITBAND(&(base)->CR2, USART_CR2_LBCL_bit)
#define USARTx_CR2_LBDIE_bb(base)			BITBAND(&(base)->CR2, USART_CR2_LBDIE_bit)
#define USARTx_CR2_LBDL_bb(base)			BITBAND(&(base)->CR2, USART_CR2_LBDL_bit)
#define USARTx_CR2_ADD_0_bb(base)			BITBAND(&(base)->CR2, USART_CR2_ADD_0_bit)
#define USARTx_CR2_ADD_1_bb(base)			BITBAND(&(base)->CR2, USART_CR2_ADD_1_bit)
#define USARTx_CR2_ADD_2_bb(base)			BITBAND(&(base)->CR2, USART_CR2_ADD_2_bit)
#define USARTx_CR2_ADD_3_bb(base)			BITBAND(&(base)->CR2, USART_CR2_ADD_3_bit)

#define USART1_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(USART1)
#define USART1_CR2_STOP_0_bb				USARTx_CR2_STOP_0_bb(USART1)
#define USART1_CR2_STOP_1_bb				USARTx_CR2_STOP_1_bb(USART1)
#define USART1_CR2_CLKEN_bb					USARTx_CR2_CLKEN_bb(USART1)
#define USART1_CR2_CPOL_bb					USARTx_CR2_CPOL_bb(USART1)
#define USART1_CR2_CPHA_bb					USARTx_CR2_CPHA_bb(USART1)
#define USART1_CR2_LBCL_bb					USARTx_CR2_LBCL_bb(USART1)
#define USART1_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(USART1)
#define USART1_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(USART1)
#define USART1_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(USART1)
#define USART1_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(USART1)
#define USART1_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(USART1)
#define USART1_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(USART1)

#define USART2_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(USART2)
#define USART2_CR2_STOP_0_bb				USARTx_CR2_STOP_0_bb(USART2)
#define USART2_CR2_STOP_1_bb				USARTx_CR2_STOP_1_bb(USART2)
#define USART2_CR2_CLKEN_bb					USARTx_CR2_CLKEN_bb(USART2)
#define USART2_CR2_CPOL_bb					USARTx_CR2_CPOL_bb(USART2)
#define USART2_CR2_CPHA_bb					USARTx_CR2_CPHA_bb(USART2)
#define USART2_CR2_LBCL_bb					USARTx_CR2_LBCL_bb(USART2)
#define USART2_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(USART2)
#define USART2_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(USART2)
#define USART2_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(USART2)
#define USART2_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(USART2)
#define USART2_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(USART2)
#define USART2_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(USART2)

#define USART3_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(USART3)
#define USART3_CR2_STOP_0_bb				USARTx_CR2_STOP_0_bb(USART3)
#define USART3_CR2_STOP_1_bb				USARTx_CR2_STOP_1_bb(USART3)
#define USART3_CR2_CLKEN_bb					USARTx_CR2_CLKEN_bb(USART3)
#define USART3_CR2_CPOL_bb					USARTx_CR2_CPOL_bb(USART3)
#define USART3_CR2_CPHA_bb					USARTx_CR2_CPHA_bb(USART3)
#define USART3_CR2_LBCL_bb					USARTx_CR2_LBCL_bb(USART3)
#define USART3_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(USART3)
#define USART3_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(USART3)
#define USART3_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(USART3)
#define USART3_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(USART3)
#define USART3_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(USART3)
#define USART3_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(USART3)

#define UART4_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(UART4)
#define UART4_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(UART4)
#define UART4_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(UART4)
#define UART4_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(UART4)
#define UART4_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(UART4)
#define UART4_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(UART4)
#define UART4_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(UART4)

