DISTORTEC/distortos/source/chip/STM32/peripherals/USARTv1/include/distortos/chip/STM32-USARTv1-bits.h
#define UART5_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(UART5)
#define UART5_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(UART5)
#define UART5_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(UART5)
#define UART5_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(UART5)
#define UART5_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(UART5)
#define UART5_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(UART5)
#define UART5_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(UART5)

#define USART6_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(USART6)
#define USART6_CR2_STOP_0_bb				USARTx_CR2_STOP_0_bb(USART6)
#define USART6_CR2_STOP_1_bb				USARTx_CR2_STOP_1_bb(USART6)
#define USART6_CR2_CLKEN_bb					USARTx_CR2_CLKEN_bb(USART6)
#define USART6_CR2_CPOL_bb					USARTx_CR2_CPOL_bb(USART6)
#define USART6_CR2_CPHA_bb					USARTx_CR2_CPHA_bb(USART6)
#define USART6_CR2_LBCL_bb					USARTx_CR2_LBCL_bb(USART6)
#define USART6_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(USART6)
#define USART6_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(USART6)
#define USART6_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(USART6)
#define USART6_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(USART6)
#define USART6_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(USART6)
#define USART6_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(USART6)

#define UART7_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(UART7)
#define UART7_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(UART7)
#define UART7_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(UART7)
#define UART7_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(UART7)
#define UART7_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(UART7)
#define UART7_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(UART7)
#define UART7_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(UART7)

#define UART8_CR2_LINEN_bb					USARTx_CR2_LINEN_bb(UART8)
#define UART8_CR2_LBDIE_bb					USARTx_CR2_LBDIE_bb(UART8)
#define UART8_CR2_LBDL_bb					USARTx_CR2_LBDL_bb(UART8)
#define UART8_CR2_ADD_0_bb					USARTx_CR2_ADD_0_bb(UART8)
#define UART8_CR2_ADD_1_bb					USARTx_CR2_ADD_1_bb(UART8)
#define UART8_CR2_ADD_2_bb					USARTx_CR2_ADD_2_bb(UART8)
#define UART8_CR2_ADD_3_bb					USARTx_CR2_ADD_3_bb(UART8)

/*---------------------------------------------------------------------------------------------------------------------+
| USART_CR3 - Control register 3
+---------------------------------------------------------------------------------------------------------------------*/

#define USART_CR3_ONEBIT_bit				11
#define USART_CR3_CTSIE_bit					10
#define USART_CR3_CTSE_bit					9
#define USART_CR3_RTSE_bit					8
#define USART_CR3_DMAT_bit					7
#define USART_CR3_DMAR_bit					6
#define USART_CR3_SCEN_bit					5
#define USART_CR3_NACK_bit					4
#define USART_CR3_HDSEL_bit					3
#define USART_CR3_IRLP_bit					2
#define USART_CR3_IREN_bit					1
#define USART_CR3_EIE_bit					0

#define USARTx_CR3_ONEBIT_bb(base)			BITBAND(&(base)->CR3, USART_CR3_ONEBIT_bit)
#define USARTx_CR3_CTSIE_bb(base)			BITBAND(&(base)->CR3, USART_CR3_CTSIE_bit)
#define USARTx_CR3_CTSE_bb(base)			BITBAND(&(base)->CR3, USART_CR3_CTSE_bit)
#define USARTx_CR3_RTSE_bb(base)			BITBAND(&(base)->CR3, USART_CR3_RTSE_bit)
#define USARTx_CR3_DMAT_bb(base)			BITBAND(&(base)->CR3, USART_CR3_DMAT_bit)
#define USARTx_CR3_DMAR_bb(base)			BITBAND(&(base)->CR3, USART_CR3_DMAR_bit)
#define USARTx_CR3_SCEN_bb(base)			BITBAND(&(base)->CR3, USART_CR3_SCEN_bit)
#define USARTx_CR3_NACK_bb(base)			BITBAND(&(base)->CR3, USART_CR3_NACK_bit)
#define USARTx_CR3_HDSEL_bb(base)			BITBAND(&(base)->CR3, USART_CR3_HDSEL_bit)
#define USARTx_CR3_IRLP_bb(base)			BITBAND(&(base)->CR3, USART_CR3_IRLP_bit)
#define USARTx_CR3_IREN_bb(base)			BITBAND(&(base)->CR3, USART_CR3_IREN_bit)
#define USARTx_CR3_EIE_bb(base)				BITBAND(&(base)->CR3, USART_CR3_EIE_bit)

#define USART1_CR3_ONEBIT_bb				USARTx_CR3_ONEBIT_bb(USART1)
#define USART1_CR3_CTSIE_bb					USARTx_CR3_CTSIE_bb(USART1)
#define USART1_CR3_CTSE_bb					USARTx_CR3_CTSE_bb(USART1)
#define USART1_CR3_RTSE_bb					USARTx_CR3_RTSE_bb(USART1)
#define USART1_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(USART1)
#define USART1_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(USART1)
#define USART1_CR3_SCEN_bb					USARTx_CR3_SCEN_bb(USART1)
#define USART1_CR3_NACK_bb					USARTx_CR3_NACK_bb(USART1)
#define USART1_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(USART1)
#define USART1_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(USART1)
#define USART1_CR3_IREN_bb					USARTx_CR3_IREN_bb(USART1)
#define USART1_CR3_EIE_bb					USARTx_CR3_EIE_bb(USART1)

#define USART2_CR3_ONEBIT_bb				USARTx_CR3_ONEBIT_bb(USART2)
#define USART2_CR3_CTSIE_bb					USARTx_CR3_CTSIE_bb(USART2)
#define USART2_CR3_CTSE_bb					USARTx_CR3_CTSE_bb(USART2)
#define USART2_CR3_RTSE_bb					USARTx_CR3_RTSE_bb(USART2)
#define USART2_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(USART2)
#define USART2_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(USART2)
#define USART2_CR3_SCEN_bb					USARTx_CR3_SCEN_bb(USART2)
#define USART2_CR3_NACK_bb					USARTx_CR3_NACK_bb(USART2)
#define USART2_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(USART2)
#define USART2_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(USART2)
#define USART2_CR3_IREN_bb					USARTx_CR3_IREN_bb(USART2)
#define USART2_CR3_EIE_bb					USARTx_CR3_EIE_bb(USART2)

#define USART3_CR3_ONEBIT_bb				USARTx_CR3_ONEBIT_bb(USART3)
#define USART3_CR3_CTSIE_bb					USARTx_CR3_CTSIE_bb(USART3)
#define USART3_CR3_CTSE_bb					USARTx_CR3_CTSE_bb(USART3)
#define USART3_CR3_RTSE_bb					USARTx_CR3_RTSE_bb(USART3)
#define USART3_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(USART3)
#define USART3_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(USART3)
#define USART3_CR3_SCEN_bb					USARTx_CR3_SCEN_bb(USART3)
#define USART3_CR3_NACK_bb					USARTx_CR3_NACK_bb(USART3)
#define USART3_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(USART3)
#define USART3_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(USART3)
#define USART3_CR3_IREN_bb					USARTx_CR3_IREN_bb(USART3)
#define USART3_CR3_EIE_bb					USARTx_CR3_EIE_bb(USART3)

#define UART4_CR3_ONEBIT_bb					USARTx_CR3_ONEBIT_bb(UART4)
#define UART4_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(UART4)
#define UART4_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(UART4)
#define UART4_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(UART4)
#define UART4_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(UART4)
#define UART4_CR3_IREN_bb					USARTx_CR3_IREN_bb(UART4)
#define UART4_CR3_EIE_bb					USARTx_CR3_EIE_bb(UART4)

#define UART5_CR3_ONEBIT_bb					USARTx_CR3_ONEBIT_bb(UART5)
#define UART5_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(UART5)
#define UART5_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(UART5)
#define UART5_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(UART5)
#define UART5_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(UART5)
#define UART5_CR3_IREN_bb					USARTx_CR3_IREN_bb(UART5)
#define UART5_CR3_EIE_bb					USARTx_CR3_EIE_bb(UART5)

#define USART6_CR3_ONEBIT_bb				USARTx_CR3_ONEBIT_bb(USART6)
#define USART6_CR3_CTSIE_bb					USARTx_CR3_CTSIE_bb(USART6)
#define USART6_CR3_CTSE_bb					USARTx_CR3_CTSE_bb(USART6)
#define USART6_CR3_RTSE_bb					USARTx_CR3_RTSE_bb(USART6)
#define USART6_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(USART6)
#define USART6_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(USART6)
#define USART6_CR3_SCEN_bb					USARTx_CR3_SCEN_bb(USART6)
#define USART6_CR3_NACK_bb					USARTx_CR3_NACK_bb(USART6)
#define USART6_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(USART6)
#define USART6_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(USART6)
#define USART6_CR3_IREN_bb					USARTx_CR3_IREN_bb(USART6)
#define USART6_CR3_EIE_bb					USARTx_CR3_EIE_bb(USART6)

#define UART7_CR3_ONEBIT_bb					USARTx_CR3_ONEBIT_bb(UART7)
#define UART7_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(UART7)
#define UART7_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(UART7)
#define UART7_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(UART7)
#define UART7_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(UART7)
#define UART7_CR3_IREN_bb					USARTx_CR3_IREN_bb(UART7)
#define UART7_CR3_EIE_bb					USARTx_CR3_EIE_bb(UART7)

#define UART8_CR3_ONEBIT_bb					USARTx_CR3_ONEBIT_bb(UART8)
#define UART8_CR3_DMAT_bb					USARTx_CR3_DMAT_bb(UART8)
#define UART8_CR3_DMAR_bb					USARTx_CR3_DMAR_bb(UART8)
#define UART8_CR3_HDSEL_bb					USARTx_CR3_HDSEL_bb(UART8)
#define UART8_CR3_IRLP_bb					USARTx_CR3_IRLP_bb(UART8)
#define UART8_CR3_IREN_bb					USARTx_CR3_IREN_bb(UART8)
#define UART8_CR3_EIE_bb					USARTx_CR3_EIE_bb(UART8)

#endif /* SOURCE_CHIP_STM32_PERIPHERALS_USARTV1_INCLUDE_DISTORTOS_CHIP_STM32_USARTV1_BITS_H_ */
